; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c7-s6-p4-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 c5 c6 
          t0 t1 t2 t3 t4 t5 t6 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 l5-0 l5-1 l5-2 l5-3 l5-4 l5-5 l6-0 l6-1 l6-2 l6-3 l6-4 l6-5 
          p0 p1 p2 p3 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l5-4)
    (in-city  l5-4 c5)
    (LOCATION l5-5)
    (in-city  l5-5 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l6-2)
    (in-city  l6-2 c6)
    (LOCATION l6-3)
    (in-city  l6-3 c6)
    (LOCATION l6-4)
    (in-city  l6-4 c6)
    (LOCATION l6-5)
    (in-city  l6-5 c6)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (at t0 l0-4)
    (at t1 l1-2)
    (at t2 l2-5)
    (at t3 l3-0)
    (at t4 l4-0)
    (at t5 l5-5)
    (at t6 l6-5)
    (at p0 l1-0)
    (at p1 l6-5)
    (at p2 l1-0)
    (at p3 l6-5)
    (at a0 l3-0)
    (at a1 l5-0)
    (at a2 l6-0)
)
(:goal
    (and
        (at p0 l3-1)
        (at p1 l0-1)
        (at p2 l3-1)
        (at p3 l6-3)
    )
)

  (:constraints
    (and
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p3 a2)))
    )
  )
)

; plan
1. (drive-truck t0 l0-4 l0-1 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-1)
   goals met: 0 of 4
2. (load-truck p3 t6 l6-5)
   deleted: (at p3 l6-5)
   added: (in p3 t6)
   goals met: 0 of 4
3. (load-truck p1 t6 l6-5)
   deleted: (at p1 l6-5)
   added: (in p1 t6)
   goals met: 0 of 4
4. (fly-airplane a0 l3-0 l6-0)
   deleted: (at a0 l3-0)
   added: (at a0 l6-0)
   goals met: 0 of 4
5. (fly-airplane a1 l5-0 l3-0)
   deleted: (at a1 l5-0)
   added: (at a1 l3-0)
   goals met: 0 of 4
6. (fly-airplane a2 l6-0 l3-0)
   deleted: (at a2 l6-0)
   added: (at a2 l3-0)
   goals met: 0 of 4
7. (drive-truck t6 l6-5 l6-3 c6)
   deleted: (at t6 l6-5)
   added: (at t6 l6-3)
   goals met: 0 of 4
8. (fly-airplane a1 l3-0 l1-0)
   deleted: (at a1 l3-0)
   added: (at a1 l1-0)
   goals met: 0 of 4
9. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 4
10. (unload-truck p3 t6 l6-3)
   deleted: (in p3 t6)
   added: (at p3 l6-3)
   goals met: 1 of 4
11. (load-airplane p2 a1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a1)
   goals met: 1 of 4
12. (load-airplane p0 a1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 1 of 4
13. (drive-truck t6 l6-3 l6-0 c6)
   deleted: (at t6 l6-3)
   added: (at t6 l6-0)
   goals met: 1 of 4
14. (fly-airplane a1 l1-0 l3-0)
   deleted: (at a1 l1-0)
   added: (at a1 l3-0)
   goals met: 1 of 4
15. (unload-truck p1 t6 l6-0)
   deleted: (in p1 t6)
   added: (at p1 l6-0)
   goals met: 1 of 4
16. (unload-airplane p2 a1 l3-0)
   deleted: (in p2 a1)
   added: (at p2 l3-0)
   goals met: 1 of 4
17. (unload-airplane p0 a1 l3-0)
   deleted: (in p0 a1)
   added: (at p0 l3-0)
   goals met: 1 of 4
18. (load-airplane p1 a0 l6-0)
   deleted: (at p1 l6-0)
   added: (in p1 a0)
   goals met: 1 of 4
19. (load-truck p2 t3 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 t3)
   goals met: 1 of 4
20. (load-truck p0 t3 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 t3)
   goals met: 1 of 4
21. (fly-airplane a0 l6-0 l0-0)
   deleted: (at a0 l6-0)
   added: (at a0 l0-0)
   goals met: 1 of 4
22. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 4
23. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 1 of 4
24. (unload-truck p2 t3 l3-1)
   deleted: (in p2 t3)
   added: (at p2 l3-1)
   goals met: 2 of 4
25. (unload-truck p0 t3 l3-1)
   deleted: (in p0 t3)
   added: (at p0 l3-1)
   goals met: 3 of 4
26. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 3 of 4
27. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 3 of 4
28. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 4 of 4
